<h1> Analysis and Building Model about My Daily Tutoring </h1>

In [21]:
import pandas as pd

df = pd.read_excel('Teaching_1.xlsx')

df.head()

     Tanggal  Lembaga Nama Siswa    Kelas      Waktu       Fee (Rp)     Fee
0 2021-09-01   MTSN 7          -        9   90 Menit  Rp. 130.000,-  130000
1 2021-09-07  MAESTRO          -  Diskusi  180 Menit   Rp. 80.000,-   80000
2 2021-09-08   MTSN 7          -        9   90 Menit  Rp. 130.000,-  130000
3 2021-09-10  MAESTRO          -  Diskusi  180 Menit   Rp. 80.000,-   80000
4 2021-09-13  MAESTRO          -       10  180 Menit   Rp. 80.000,-   80000

In [2]:
df.describe()

                 Fee
count     305.000000
mean   139702.295082
std     47035.174002
min     31000.000000
25%     96000.000000
50%    130000.000000
75%    175000.000000
max    292500.000000

In [7]:
df.isnull().sum()

Tanggal       0
Lembaga       3
Nama Siswa    0
Kelas         0
Waktu         0
Fee (Rp)      0
Fee           0
dtype: int64

In [8]:
df[df['Lembaga'].isnull()]

       Tanggal Lembaga Nama Siswa Kelas     Waktu       Fee (Rp)     Fee
67  2021-12-09     NaN     Zaidan     9  90 Menit  Rp. 150.000,-  150000
245 2022-09-26     NaN       Luiz     9  90 menit  Rp. 120.000,-  120000
246 2022-09-27     NaN       Luiz     9  90 menit  Rp. 120.000,-  120000

In [9]:
df.fillna('Private', inplace=True)

In [11]:
df.nunique()

Tanggal       232
Lembaga        24
Nama Siswa     27
Kelas          16
Waktu          11
Fee (Rp)       27
Fee            28
dtype: int64

### Name of each students

In [12]:
df['Nama Siswa'].unique()

array(['-', 'Falah', 'Yumna', 'Hary', 'Arrafi', 'Rafi', 'Raffie',
       'Bintang', 'Melvin', 'Hazel', 'Zaidan', 'Salma', 'Reynard',
       'Adel ', 'Reva', 'Sahan', 'Agung', 'Edward', 'Ara', 'Luiz',
       'Dafin', 'Nisa', 'Daru ', 'Nisa ', 'Jafar', 'Misel & Bram',
       'Ananto'], dtype=object)

### Which Institution is more likely to hire me than the others

In [19]:
df['Lembaga'].unique()

array(['MTSN 7', 'MAESTRO', 'LATIS', 'MTSN 6', 'INSAN CERDAS',
       ' INSAN PRESTASI', 'RUANGGURU', 'Private', 'MTsN 7', 'Maestro ',
       'RUANGGURU ', 'BigBang', 'IP', 'MtsN 34', 'MtsN 4 ', 'Pelita',
       'MtsN 33', 'MtsN 17', 'MtsN 7', 'Latis', 'AksesGuru',
       'Insan Cerdas', 'Maestro', '-'], dtype=object)

### Base on these data, i can build a model to prediction:

### 1.) which institution is more likely hire me as a teacher
### 2.) fee based on instituion, duration and grade